
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <meta name="generator" content="Website XSL Stylesheet V1.69.1"><link rel="home" href="index.html" title="TEF : M&eacute;tadonn&eacute;es des th&egrave;ses fran&ccedil;aises"><link rel="up" href="index.html" title="TEF : M&eacute;tadonn&eacute;es des th&egrave;ses fran&ccedil;aises"><link rel="previous" href="xml.html" title="TEF en XML"><link rel="next" href="http://tefsav.canalblog.com" title="Blog"><link rel="first" href="recommandation.html" title="La recommandation"><link rel="last" href="http://tefsav.canalblog.com" title="Blog"><link rel="stylesheet" href="tefsite.css" type="text/css">
		<title>FAQ</title>
		<meta name="keyword" content="m&eacute;tadonn&eacute;es, metadata, th&egrave;ses, thesis, etd, recommandation afnor, afnor&#xA;recommendation, xsl, xslt">
	</head><body class="tabular" bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="webpage"><a name="faq"></a><table border="0" cellpadding="0" cellspacing="0" width="100%" summary="Navigation"><tr><td valign="top" align="left" bgcolor="#BCD2EE"><img src="graphics/spacer.gif" alt=" " width="1" height="1"></td><td valign="top" align="left" bgcolor="white" rowspan="2"><h1>FAQ</h1><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d69e11"></a>Questions g&eacute;n&eacute;rales sur TEF</h2></div></div></div>
		
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e16"></a>Qu'est-ce que TEF ?</h3></div></div></div>
			
			<p> La recommandation TEF (Th&egrave;ses Electroniques Fran&ccedil;aises) d&eacute;finit un jeu de
				m&eacute;tadonn&eacute;es pour les th&egrave;ses &eacute;lectroniques soutenues en France. Son objectif est
				d'organiser de mani&egrave;re coh&eacute;rente des m&eacute;tadonn&eacute;es de th&egrave;se riches et normalis&eacute;es,
				pour faciliter leur &eacute;change et leur diffusion, au niveau national ou international.
				Ces m&eacute;tadonn&eacute;es sont h&eacute;t&eacute;rog&egrave;nes. Elles recouvrent des m&eacute;tadonn&eacute;es descriptives
				(bibliographiques) et des m&eacute;tadonn&eacute;es de gestion (administration, droits,
				conservation).</p>
			<p>Cette recommandation propose &agrave; la fois une mod&eacute;lisation de ces m&eacute;tadonn&eacute;es et un
				format XML. Ce format est un format d'&eacute;change et un outil de validation. Il consiste
				en un sch&eacute;ma XML qui permet de sp&eacute;cifier la structure et le contenu d'une notice
				TEF. S'y ajoutent des r&egrave;gles de validation Schematron qui expriment avec pr&eacute;cision
				les contraintes propres &agrave; TEF, qui elles-m&ecirc;mes refl&egrave;tent les textes r&eacute;glementaires
				nationaux qui organisent le circuit des th&egrave;ses &eacute;lectroniques . Ce format XML
				s'appuie sur le sch&eacute;ma METS qui permet d'articuler les diff&eacute;rents types de
				m&eacute;tadonn&eacute;es.</p>
			<p>En s'appuyant sur METS et Schematron, TEF n'est pas tant un nouveau format qu'une
				structure modulaire et souple qui pourra s'adapter aux &eacute;volutions du cadre
				r&eacute;glementaire ou &agrave; un contexte d'utilisation particulier. </p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e31"></a>A qui s'adresse cette recommandation ?</h3></div></div></div>
			
			<p>Cette recommandation n'est pas un manuel de catalogage des th&egrave;ses.</p>
			<p>D'une part, TEF ne concerne pas que la description bibliographique des th&egrave;ses.
				Elle int&eacute;resse donc d'autres m&eacute;tiers que celui des biblioth&egrave;ques, en particulier les
				&eacute;coles doctorales, les services de scolarit&eacute; ou encore les centres de ressources
				informatiques.</p>
			<p>D'autre part, TEF n'est pas tant un guide d'utilisation des m&eacute;tadonn&eacute;es au
				quotidien qu'un document normatif technique destin&eacute; aux concepteurs et gestionnaires
				de syst&egrave;mes d'information (d&eacute;di&eacute;s ou non aux th&egrave;ses).</p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e46"></a>Quel est le cadre r&eacute;glementaire en vigueur sur les th&egrave;ses &eacute;lectroniques ?</h3></div></div></div>
			
			<p>TEF ob&eacute;it &agrave; des contraintes qui proviennent des textes r&eacute;glementaires encadrant
				les th&egrave;ses &eacute;lectroniques. Le texte de r&eacute;f&eacute;rence est &agrave; ce jour la <a href="http://www.sup.adc.education.fr/bib/Acti/These/circulaire.rtf" target="_top">circulaire
					de mars 2005</a>, qui pr&eacute;c&egrave;de la publication d'un nouvel arr&ecirc;t&eacute; sur les
				th&egrave;ses.</p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e58"></a>A quoi sert TEF ?</h3></div></div></div>
			
			<p>La vocation premi&egrave;re de TEF est d'offrir un cadre rigoureux pour faciliter les
				&eacute;changes de m&eacute;tadonn&eacute;es de th&egrave;se entre diverses applications. TEF est avant tout un
				format d'&eacute;change. Dans le circuit national, TEF sera utilis&eacute; pour &eacute;changer des
				m&eacute;tadonn&eacute;es entre les syst&egrave;mes d'information des &eacute;tablissements de soutenance et
				l'application nationale STAR, g&eacute;r&eacute;e par l'ABES.</p>
			<p>Sur les diff&eacute;rents usages possibles de TEF, cf. <a href="http://www.abes.fr/abes/documents/tef/recommandation/usages.html" target="_top">la
					recommandation elle-m&ecirc;me</a>. </p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e73"></a>Quel est le statut de TEF ?</h3></div></div></div>
			
			<p>TEF est une recommandation produite par un groupe d'experts <span class="emphasis"><em>ad
				hoc</em></span> CG46/CN357/GE5 qui, dans le cadre de l'AFNOR, rassemble des
				documentalistes, des biblioth&eacute;caires et des informaticiens issus de divers
				&eacute;tablissements de l'Enseignement Sup&eacute;rieur et de la Recherche.</p>
			<p>Le groupe est en train d'examiner les r&eacute;ponses re&ccedil;ues pendant la phase d'appel &agrave; commentaires. Le texte amend&eacute; de la recommandation sera bient&ocirc;t disponible.</p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e88"></a>TEF s'applique-t-elle &agrave; toutes les th&egrave;ses ?</h3></div></div></div>
			
			<p>Sont concern&eacute;es par cette recommandation toutes les th&egrave;ses valid&eacute;es par un
				&eacute;tablissement d'enseignement sup&eacute;rieur et de recherche fran&ccedil;ais habilit&eacute;s &agrave; d&eacute;livrer
				le dipl&ocirc;me de docteur. Ce p&eacute;rim&egrave;tre englobe les th&egrave;ses d'Etat, les th&egrave;ses de
				troisi&egrave;me cycle et les th&egrave;ses de doctorat (dites "nouveau r&eacute;gime"). TEF s'applique &agrave;
				toutes les th&egrave;ses appartenant &agrave; ces trois cat&eacute;gories et &agrave; elles seules.</p>
			<p>
				<a href="http://www.abes.fr/abes/documents/tef/recommandation/domaine.html" target="_top">Pour
					en savoir plus</a>
			</p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e103"></a>Comme les m&eacute;tadonn&eacute;es TEF sont en XML, seules les th&egrave;ses en XML sont-elles
				concern&eacute;es ?</h3></div></div></div>
			
			<p>NON, toutes les th&egrave;ses num&eacute;riques sont concern&eacute;es, ind&eacute;pendamment de leur format.
				Les m&eacute;tadonn&eacute;es TEF peuvent s'appliquer &agrave; une &eacute;dition PDF ou HTML, aussi bien qu'&agrave;
				une &eacute;dition XML.</p>
			<p>Certes, dans le cas d'une th&egrave;se en XML, certaines m&eacute;tadonn&eacute;es peuvent en principe
				&ecirc;tre extraites de la th&egrave;se elle-m&ecirc;me, notamment de la page de titre structur&eacute;e
				(titre, auteur, r&eacute;sum&eacute;, date...). N&eacute;anmoins, d'une mani&egrave;re g&eacute;n&eacute;rale, les m&eacute;tadonn&eacute;es
				sont trait&eacute;es ind&eacute;pendamment du document lui-m&ecirc;me.</p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e115"></a>TEF s'appuie sur un noyau de m&eacute;tadonn&eacute;es Dublin Core ? Pourquoi aller au-del&agrave; ?</h3></div></div></div>
			
			<p>Les m&eacute;tadonn&eacute;es Dublin Core servent essentiellement &agrave; identifier et d&eacute;crire les
				documents num&eacute;riques. A ce titre, elles ne peuvent suffire &agrave; exprimer toutes les
				m&eacute;tadonn&eacute;es de gestion qu'exige le traitement des th&egrave;ses &eacute;lectroniques. En
				particulier, il leur manque des m&eacute;tadonn&eacute;es de droits fines, des m&eacute;tadonn&eacute;es
				administratives relatives au dipl&ocirc;me et des m&eacute;tadonn&eacute;es de conservation. Enfin, il
				est difficile voire impossible d'exprimer en Dublin Core et son encodage XML
				certaines informations bibliographiques essentielles, comme la r&eacute;f&eacute;rence &agrave; des
				notices d'autorit&eacute;. </p>
		</div>
	</div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d69e124"></a>Questions sur la mod&eacute;lisation des m&eacute;tadonn&eacute;es dans TEF</h2></div></div></div>
		
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e129"></a>Pourquoi un mod&egrave;le dans TEF ?</h3></div></div></div>
			
			<p>La recommandation comprend une <a href="http://www.abes.fr/abes/documents/tef/recommandation/modeleTEF.html" target="_top">mod&eacute;lisation des th&egrave;ses</a> qui permet de structurer les m&eacute;tadonn&eacute;es des
				th&egrave;ses ind&eacute;pendamment d'une syntaxe ou d'un format particuliers, ce qui a au moins
				trois vertus : </p>
			<div class="itemizedlist"><ul type="disc"><li>
					<p>identifier de mani&egrave;re explicite les entit&eacute;s dont
						"parlent" les m&eacute;tadonn&eacute;es ;</p>
				</li><li>
					<p>proposer diff&eacute;rentes syntaxes. Aujourd'hui, la recommandation propose un
						format XML. Un sch&eacute;ma RDF est en pr&eacute;paration.</p>
				</li><li>
					<p>mieux organiser la structure des donn&eacute;es. Dans le cas du format XML, la
						mod&eacute;lisation a aid&eacute; &agrave; d&eacute;finir des blocs de m&eacute;tadonn&eacute;es de mani&egrave;re modulaire
						et extensible. Quant au format RDF, il d&eacute;rive presque imm&eacute;diatement de la
						mod&eacute;lisation.</p>
				</li></ul></div>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e162"></a>Pourquoi expliciter la notion de version ?</h3></div></div></div>
			
			<p>La mod&eacute;lisation TEF distingue entre la th&egrave;se comme oeuvre, la th&egrave;se comme version
				et la th&egrave;se comme &eacute;dition. En principe, la th&egrave;se n'existe qu'&agrave; travers la version
				qui a &eacute;t&eacute; valid&eacute;e par le jury (version compl&egrave;te). Dans les faits, pour des raisons
				administratives, juridiques voire techniques, la th&egrave;se peut &ecirc;tre publi&eacute;e sous une
				forme tronqu&eacute;e. TEF parle alors de "version incompl&egrave;te".</p>
			<p>Il existe aussi d'autres versions de la th&egrave;se, comme les diff&eacute;rents &eacute;tats de la
				th&egrave;se avant la soutenance ou apr&egrave;s la soutenance, sous la forme d'une &eacute;dition
				commerciale par exemple. Ces cas ne correspondent pas &agrave; une "version incompl&egrave;te" car
				il ne s'agit pas de versions partielles du texte officiel, mais de textes voisins.</p>
			<p>C'est donc avant tout pour des raisons administratives que la notion de version
				est si importante dans le cas des th&egrave;ses : une th&egrave;se est un document administratif,
				d&eacute;livrant un dipl&ocirc;me, en regard d'un texte pr&eacute;cis valid&eacute; par un jury - c'est la
				version compl&egrave;te de la th&egrave;se.</p>
			<p>Si la version compl&egrave;te ne peut &ecirc;tre publi&eacute;e, un &eacute;tablissement, avec l'accord de
				l'auteur, peut choisir de publier une version incompl&egrave;te. Il importe alors
				d'identifier cette version, d'en d&eacute;crire le contenu (que lui manque-t-il ?) et d'en
				conna&icirc;tre le statut (est-elle diffusable ?).</p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e180"></a>Pourquoi donner tant d'importance et de d&eacute;tails aux m&eacute;tadonn&eacute;es de droits ?</h3></div></div></div>
			
			<p>Une th&egrave;se est un document &agrave; plusieurs facettes, au centre d'int&eacute;r&ecirc;ts juridiques et
				administratifs divers et parfois contradictoires. Sa diffusion suppose
				l'autorisation d'un jury (validation scientifique), celle de l'&eacute;tablissement
				(validation administrative), celle de l'auteur (cession de droits d'auteur) et
				enfin, &eacute;ventuellement, l'autorisation des tiers qui d&eacute;tiennent des droits sur des
				oeuvres tierces que la th&egrave;se int&egrave;gre, en tout ou partie. C'est seulement en croisant
				ces diff&eacute;rentes sources l&eacute;gales qu'on peut savoir si telle ou telle version de la
				th&egrave;se est diffusable.</p>
			<p>C'est pourquoi TEF distingue entre, d'une part, ces diff&eacute;rentes autorisations,
				qu'il est important de documenter, et d'autre part, le statut de chaque version
				(compte tenu des autorisations et de son contenu, est-elle diffusable ?).</p>
			<p>En structurant ces m&eacute;tadonn&eacute;es de droits, TEF permet d'automatiser en partie la
				gestion des th&egrave;ses, notamment l'extinction de la p&eacute;riode de confidentialit&eacute;.</p>
			<p>Les r&eacute;cents accords entre le Minist&egrave;re de Education Nationale et les soci&eacute;t&eacute;s de
				gestion collective portant sur l'utilisation des oeuvres prot&eacute;g&eacute;es dans les
				contextes d'enseignement et de recherche obligent &agrave; aller dans ce sens. TEF pr&eacute;voit
				les m&eacute;canismes pour exprimer qu'une oeuvre prot&eacute;g&eacute;e est utilis&eacute;e dans une th&egrave;se,
				pour la citer, pour exprimer son statut juridique et les cons&eacute;quences sur le statut
				juridique de la th&egrave;se en tant que telle. Voir, par exemple, <a href="http://politechnicart.net/exception/accords/Ecrit%20Version%20signature%2027-02-06.pdf" target="_top">l'accord sur l'utilisation des livres et de la musique imprim&eacute;e</a> (27
				f&eacute;vrier 2006).</p>
		</div>
	</div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d69e201"></a>Questions sur le format XML de TEF</h2></div></div></div>
		
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e206"></a>Pourquoi XML ?</h3></div></div></div>
			
			<p>XML est, avec HTML, la lingua franca du Web. Mais, alors qu'HTML structure
				l'information pour la rendre visible &agrave; l'&eacute;cran, XML permet une exploitation de
				l'information par des programmes, et donc sa r&eacute;utilisation par diff&eacute;rents acteurs,
				dans diff&eacute;rents contextes. De plus, XML n'est pas seulement une syntaxe, mais aussi
				un famille de technologies qui permettent de valider, transformer ou interroger
				l'information. Les diff&eacute;rents types de sch&eacute;mas XML, en particulier, permettent de
				contr&ocirc;ler finement les donn&eacute;es, de v&eacute;rifier qu'elles sont bien conformes &agrave; ce qu'on
				souhaite. C'est pourquoi XML est le bon instrument pour &eacute;crire un format d'&eacute;change
				de m&eacute;tadonn&eacute;es.</p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e215"></a>Pourquoi METS ?</h3></div></div></div>
			
			<p>
				<a href="http://www.loc.gov/standards/mets/" target="_top">METS</a> (Metadata Encoding and
				Transmission Standard) est un standard maintenu par la Biblioth&egrave;que du Congr&egrave;s.
				C'est un vocabulaire XML qui permet d'organiser des m&eacute;tadonn&eacute;es vari&eacute;es se
				rapportant &agrave; un objet num&eacute;rique complexe (revues num&eacute;riques, sites Web...). Dans la
				perspective de TEF, METS pr&eacute;sente quatre caract&eacute;ristiques particuli&egrave;rement
				int&eacute;ressantes :</p>
			<div class="itemizedlist"><ul type="disc"><li>
					<p>la carte de structure (mets:structMap) qui permet d'inventorier les
						diff&eacute;rentes composantes logiques ou physiques d'un objet num&eacute;rique
					complexe</p>
				</li><li>
					<p>la section des fichiers (mets:fileSec) qui permet d'inventorier les
						fichiers et de consigner leur mode d'organisation physique</p>
				</li><li>
					<p>le fait que METS ne prescrive aucun langage de m&eacute;tadonn&eacute;es particulier.
						C'est une enveloppe vide dans laquelle tout type de m&eacute;tadonn&eacute;es peut &ecirc;tre
						utilis&eacute;.</p>
				</li><li>
					<p>l'organisation modulaire des m&eacute;tadonn&eacute;es : &agrave; chaque type de m&eacute;tadonn&eacute;es
						correspond un bloc XML particulier</p>
				</li></ul></div>
			<p>C'est pourquoi le format XML de TEF repose sur METS.</p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e257"></a>Pourquoi la technologie <a href="http://www.w3.org/XML/Schema" target="_top">W3C XML
				Schema</a> ? Pourquoi pas <a href="http://relaxng.org/" target="_top">Relax NG</a> ?</h3></div></div></div>
			
			<p>Etant donn&eacute; que TEF s'appuie sur des ensembles de m&eacute;tadonn&eacute;es pr&eacute;existant (METS,
				MetsRights, Dublin Core, MADS) et que ces derniers ne proposent que des sch&eacute;mas de
				type W3C XML Schema, TEF dans son ensemble a d&ucirc; utiliser ce type de sch&eacute;mas. Pour
				utiliser Relax, il aurait fallu r&eacute;&eacute;crire en Relax tous les sch&eacute;mas mentionn&eacute;s. Par
				ailleurs, TEF concentre le maximum de ses contraintes dans les r&egrave;gles Schematron, et
				non dans ses sch&eacute;mas.</p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e272"></a>Pourquoi Schematron ?</h3></div></div></div>
			
			<p>TEF a fait le choix d'exprimer le maximum de ses contraintes sous la forme de
				r&egrave;gles Schematron. Au prix d'une certaine verbosit&eacute;, ce parti-pris est le garant de
				la plus grande souplesse possible dans l'appropriation de TEF, pour les raisons qui
				suivent : </p>
			<div class="itemizedlist"><ul type="disc"><li>
					<p>Chaque contrainte est exprim&eacute;e de mani&egrave;re autonome, ce qui permet de la
						renforcer, de la rel&acirc;cher, de la supprimer ou de la compl&eacute;ter avec facilit&eacute;
						et pr&eacute;cision.</p>
				</li><li>
					<p>La notion de phase permet d'appliquer des contraintes diff&eacute;rentes selon
						l'&eacute;tape d'un processus (workflow, imports/exports).</p>
				</li><li>
					<p>Schematron est techniquement abordable et p&eacute;renne car il repose sur des
						technologies fondamentales de la famille XML (XPATH et XSLT). En
						cons&eacute;quence, Schematron n'exige pas de comp&eacute;tence ni d'outil
					sp&eacute;cifiques.</p>
				</li><li>
					<p>Les messages qui indiquent l'&eacute;chec de la validation ne sont pas g&eacute;n&eacute;r&eacute;s
						automatiquement. Ils sont &eacute;crits en langage naturel par l'auteur des r&egrave;gles,
						ce qui peut aider &agrave; la compr&eacute;hension des erreurs et &agrave; leur correction.
					</p>
				</li></ul></div>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e308"></a>Pourquoi mon validateur XML n'accepte-t-il pas le <a href="http://www.abes.fr/abes/documents/tef/recommandation/tef_schemas.xsd" target="_top">sch&eacute;ma XML TEF</a> ?</h3></div></div></div>
			
			<p>Certains outils de validation XML (comme XMLSPY) refusent d'importer deux fois les
				m&ecirc;mes &eacute;l&eacute;ments. Or, comme le sch&eacute;ma TEF importe le sch&eacute;ma METS et le sch&eacute;ma MADS qui
				importent tous deux un sch&eacute;ma XLINK d&eacute;clarant les m&ecirc;mes &eacute;l&eacute;ments, TEF importe deux
				fois les &eacute;l&eacute;ments XLINK. XMLSPY consid&egrave;re cela comme une erreur, sans doute &agrave; tort.
				C'est un probl&egrave;me bien connu (cf. ces <a href="http://listserv.loc.gov/cgi-bin/wa?A2=ind0506&amp;L=METS&amp;P=R138&amp;I=-3&amp;X=5B64891ABC425F5589&amp;Y=nicolas%40abes.fr" target="_top">discussions sur la liste METS)</a>.</p>
			<p>Que faire ? Si on ne veut pas abandonner XMLSPY, on peut faire une copie locale du
				sch&eacute;ma METS et faire en sorte qu'il importe le m&ecirc;me sch&eacute;ma XLINK que MADS. On peut
				aussi utiliser un autre outil de validation, qui n'ait pas ce comportement. Si on
				utilise Oxygen et que la m&ecirc;me erreur se produit, il suffit de changer une option
				(dans Options/Pr&eacute;f&eacute;rences/Analyseur XML, d&eacute;cocher
				http://apache.org/xml/features/honour-all-schemaLocations). </p>
		</div>
	</div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d69e326"></a>Questions sur l'utilisation de TEF</h2></div></div></div>
		
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e331"></a>Mon syst&egrave;me a son propre format interne de m&eacute;tadonn&eacute;es ? Comment le faire &eacute;voluer
				vers TEF ?</h3></div></div></div>
			
			<p>TEF n'est qu'un format d'&eacute;chnage. Un syst&egrave;me local n'a pas &agrave; supporter TEF en
				interne si son objectif est d'&eacute;changer des m&eacute;tadonn&eacute;es TEF avec l'ext&eacute;rieur. Il doit
				seulement exporter du TEF. Si le format interne est en XML, &eacute;crire un script de
				conversion XSLT est souvent la bonne m&eacute;thode.</p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e340"></a>Mon syst&egrave;me ne g&egrave;re que le Dublin Core. Comment faire pour g&eacute;rer toute la
				richesse de TEF ?</h3></div></div></div>
			
			<p>On n'a pas forc&eacute;ment besoin de toute la richesse de TEF. Ainsi, bien des
				&eacute;tablissements ne g&egrave;re la th&egrave;se qu'en PDF. Autrement dit, pour une th&egrave;se, ils ne
				g&egrave;rent qu'une version (compl&egrave;te), publi&eacute;e sous une seule &eacute;dition (en PDF), ne
				correspondant qu'&agrave; un fichier. Dans ce cas, le format interne peut demeurer une
				structure Dublin Core plate. Ce n'est qu'au cours de la conversion vers TEF que
				seront g&eacute;n&eacute;r&eacute;es automatiquement certaines sp&eacute;cificit&eacute;s de la structure de TEF.</p>
			<p>Cette question de structure ne r&eacute;sout pas la question de fond : quels sont les
				&eacute;l&eacute;ments d'information TEF qu'une structure Dublin Core qualifi&eacute; ne peut exprimer ?
				Un comparatif pr&eacute;cis est en pr&eacute;paration ainsi qu'un script XSLT de conversion qui
				pourra servir d'exemple.</p>
		</div>
		<div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d69e352"></a>TEF est-il assez souple pour s'adapter &agrave; des besoins sp&eacute;cifiques ?</h3></div></div></div>
			
			<p>Le choix de METS comme colonne vert&eacute;brale de TEF et de Schematron comme outil de
				validation principal donne &agrave; TEF une certaine souplesse. Sur Schematron, voir plus
				haut.</p>
			<p>TEF n'utilise pas toutes les fonctionnalit&eacute;s de METS. Pour autant, TEF n'interdit
				pas les fonctionnalit&eacute;s de METS qu'il n'exploite pas. Par ailleurs, &agrave; c&ocirc;t&eacute; des blocs
				de m&eacute;tadonn&eacute;es explicitement pr&eacute;vus dans la recommandation, il est toujours possible
				d'en ajouter de nouveaux, ce qui rend TEF tr&egrave;s extensible.</p>
			<p>
				<a href="http://www.abes.fr/abes/documents/tef/recommandation/usages.html#adaptations" target="_top">Pour en savoir plus</a>
			</p>
		</div>
	</div><br></td></tr><tr><td valign="top" align="left" bgcolor="#BCD2EE" width="220"><p class="navtoc"><a href="index.html"><img align="left" border="0" src="tef.jpg" alt="TEF"></a><br clear="all"><br><span class="toplevel"><img src="graphics/blank.gif" alt="&nbsp;&nbsp;&nbsp;"><a href="recommandation.html" title=""><img src="graphics/navicons/triangle/other/closed.gif" alt="&nbsp;" border="0"></a><span class="otherpage"><a href="recommandation.html" title="">La recommandation</a></span><br></span><span class="toplevel"><img src="graphics/blank.gif" alt="&nbsp;&nbsp;&nbsp;"><a href="exemples.html" title=""><img src="graphics/navicons/triangle/other/closed.gif" alt="&nbsp;" border="0"></a><span class="otherpage"><a href="exemples.html" title="">TEF en XML</a></span><br></span><span class="toplevel"><img src="graphics/blank.gif" alt="&nbsp;&nbsp;&nbsp;"><a href="faq.html"><img src="graphics/navicons/triangle/current/leaf.gif" alt="+" border="0"></a><span class="curpage">FAQ&nbsp;<img src="graphics/navicons/triangle/current/pointer.gif" alt="<-"></span><br></span><span class="toplevel"><img src="graphics/blank.gif" alt="&nbsp;&nbsp;&nbsp;"><a href="http://tefsav.canalblog.com"><img src="graphics/navicons/triangle/other/leaf.gif" alt="&nbsp;" border="0"></a><span class="otherpage"><a href="http://tefsav.canalblog.com">Blog</a></span><br></span><br></p></td></tr></table><div class="navfoot"><hr><table width="100%" border="0" summary="Footer navigation"><tr><td width="33%" align="left"><span class="footdate"></span></td><td width="34%" align="center"><span class="foothome"><a href="index.html">Home</a></span></td><td width="33%" align="right">&nbsp;</td></tr><tr><td colspan="3" align="right"><span class="footcopy"></span></td></tr></table></div></div></body></html>