<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Raison d'&ecirc;tre de la recommandation</title>
      <link rel="stylesheet" href="Traduc.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.67.2">
      <link rel="start" href="index.html" title="Les m&eacute;tadonn&eacute;es des th&egrave;ses &eacute;lectroniques fran&ccedil;aises">
      <link rel="up" href="introduction.html" title="Introduction">
      <link rel="prev" href="introduction.html" title="Introduction">
      <link rel="next" href="objet.html" title="Objet de la recommandation">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <h2 class="subtitle">TEF 1.0</h2>
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">Raison d'&ecirc;tre de la recommandation</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="introduction.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <th width="60%" align="center">Introduction</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="objet.html">Suivant</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="fr">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="raison_d_etre"></a>Raison d'&ecirc;tre de la recommandation
                  </h2>
               </div>
            </div>
         </div>
         <p></p>
         <p>A l&#8217;origine de cette recommandation, on trouve la volont&eacute; du Minist&egrave;re de l&#8217;Education nationale de valoriser et de p&eacute;renniser
            les th&egrave;ses fran&ccedil;aises gr&acirc;ce &agrave; leur diffusion par voie &eacute;lectronique. Cette volont&eacute; s&#8217;exprime dans la circulaire du 21 septembre
            2000<sup>[<a name="d0e285" href="#ftn.d0e285">1</a>]</sup>, qui tire les conclusions d&#8217;un rapport command&eacute; en 1999<sup>[<a name="d0e292" href="#ftn.d0e292">2</a>]</sup>. Cette orientation nationale suppose la mise en place de nouvelles pratiques et de nouveaux outils &agrave; tous les niveaux (circuit
            administratif, mode de production de la th&egrave;se, modalit&eacute;s de d&eacute;p&ocirc;t, cha&icirc;nes de transformation des documents, plateformes de
            diffusion, syst&egrave;me d&#8217;archivage p&eacute;renne&#8230;), mais elle a aussi plusieurs impacts sur le signalement des th&egrave;ses.
         </p>
         <p></p>
         <p>En premier lieu, en prenant la forme d&#8217;un document &eacute;lectronique en ligne, la th&egrave;se devient une ressource Internet parmi d&#8217;autres
            (mais pas exactement comme les autres). Son mode de signalement doit donc s&#8217;adapter &agrave; ce nouvel environnement. Le signalement
            de la th&egrave;se ne passe plus seulement par les catalogues de biblioth&egrave;que, qu&#8217;ils soient locaux ou collectifs, mais par une vari&eacute;t&eacute;
            de bases ou de r&eacute;pertoires. Pour ne pas &ecirc;tre confin&eacute;es dans les catalogues de biblioth&egrave;que ou les outils bibliographiques
            sp&eacute;cialis&eacute;s, les th&egrave;ses doivent pouvoir &ecirc;tre signal&eacute;es ou r&eacute;f&eacute;renc&eacute;es en m&ecirc;me temps et de la m&ecirc;me fa&ccedil;on que d&#8217;autres ressources
            (dans des bases th&eacute;matiques, des bases li&eacute;es &agrave; une institution, des moteurs de recherche g&eacute;n&eacute;ralistes). Pour ce faire, les
            th&egrave;ses doivent &ecirc;tre d&eacute;crites selon des ensembles de m&eacute;tadonn&eacute;es et des formats largement partag&eacute;s dans l&#8217;environnement Internet.
            En termes concrets, le signalement des th&egrave;ses ne peut ignorer l&#8217;ensemble de m&eacute;tadonn&eacute;es Dublin Core<a href="glossaire.html#GlossDC">**</a>
            				<sup>[<a name="d0e305" href="#ftn.d0e305">3</a>]</sup>, ni le format XML, qui sont effectivement au c&#339;ur de cette recommandation.
         </p>
         <p></p>
         <p>En second lieu, devenue &eacute;lectronique, la th&egrave;se adopte le m&ecirc;me support que ses m&eacute;tadonn&eacute;es. De ce fait, l&#8217;&eacute;change ou le partage
            d&#8217;&eacute;l&eacute;ments d&#8217;informations entre la th&egrave;se et ses m&eacute;tadonn&eacute;es sont facilit&eacute;s. Par exemple, dans le cas o&ugrave; la th&egrave;se &eacute;lectronique
            est structur&eacute;e, il est possible d&#8217;extraire automatiquement de la th&egrave;se certaines informations qui doivent figurer dans sa
            description bibliographique. De m&ecirc;me, les m&eacute;tadonn&eacute;es peuvent &ecirc;tre plus ais&eacute;ment int&eacute;gr&eacute;es dans le fichier m&ecirc;me de la th&egrave;se
            (ent&ecirc;te HTML, Syst&egrave;me XMP d&#8217;Adobe, m&eacute;tadonn&eacute;es RDF<a href="glossaire.html#GlossRDF">**</a> int&eacute;gr&eacute;es &agrave; des fichiers XHTML<sup>[<a name="d0e318" href="#ftn.d0e318">4</a>]</sup>).
         </p>
         <p></p>
         <p>En troisi&egrave;me lieu, presque toutes les &eacute;tapes du cycle de la th&egrave;se peuvent &ecirc;tre d&eacute;mat&eacute;rialis&eacute;es. Du d&eacute;p&ocirc;t du sujet &agrave; l&#8217;archivage
            p&eacute;renne de la th&egrave;se, en passant par le d&eacute;p&ocirc;t de la th&egrave;se, son catalogage ou sa consultation, tous les &eacute;v&eacute;nements de la vie
            d&#8217;une th&egrave;se peuvent prendre une forme &eacute;lectronique. En outre, toutes ces op&eacute;rations (soit de gestion, soit de description)
            n&eacute;cessitent des &eacute;l&eacute;ments d&#8217;information qui se recoupent en grande partie. Ainsi, les informations relatives au doctorant servent
            &agrave; la fois au suivi administratif de la th&egrave;se, &agrave; sa description bibliographique et &agrave; la gestion des droits associ&eacute;s, puisque
            le doctorant est &agrave; la fois un candidat au titre de docteur, un auteur et un ayant-droit. En cons&eacute;quence, les m&eacute;tadonn&eacute;es descriptives
            et les m&eacute;tadonn&eacute;es de gestion se rejoignent sur la forme (support &eacute;lectronique) et sur le fond (chevauchement entre les &eacute;l&eacute;ments
            d&#8217;information utiles). C&#8217;est pourquoi les applications informatiques charg&eacute;es de g&eacute;rer et de d&eacute;crire les th&egrave;ses &eacute;lectroniques
            devront pouvoir &eacute;changer ou partager des informations structur&eacute;es. C&#8217;est cette convergence qui explique que m&eacute;tadonn&eacute;es descriptives
            et m&eacute;tadonn&eacute;es de gestion cohabitent dans cette recommandation.
         </p>
         <p></p>
         <p>Enfin, quand le d&eacute;p&ocirc;t de la th&egrave;se sous une forme &eacute;lectronique deviendra le d&eacute;p&ocirc;t officiel voire exclusif, les m&eacute;tadonn&eacute;es
            de la th&egrave;se &eacute;lectronique officielle pourront servir &agrave; g&eacute;n&eacute;rer la plupart des m&eacute;tadonn&eacute;es des autres versions et notamment
            de la version papier (except&eacute; la collation).
         </p>
         <p></p>
         <div class="footnotes"><br><hr width="100" align="left">
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e285" href="#d0e285">1</a>] </sup>
                  						<a href="http://www.education.gouv.fr/bo/2000/34/default.htm" target="_top">http://www.education.gouv.fr/bo/2000/34/default.htm</a>
                  					
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e292" href="#d0e292">2</a>] </sup>
                  						<a href="http://www.sup.adc.education.fr/bib/Acti/These/jolly/entete.htm" target="_top">http://www.sup.adc.education.fr/bib/Acti/These/jolly/entete.htm</a>
                  					
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e305" href="#d0e305">3</a>] </sup>Le symbole ** plac&eacute; &agrave; la suite d'un mot renvoie &agrave; sa d&eacute;finition dans le <a href="glossaire.html" title="Glossaire">glossaire</a>. Il n'appara&icirc;t qu'&agrave; la premi&egrave;re occurrence de ce mot.
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e318" href="#d0e318">4</a>] </sup>
                  						<a href="http://www.w3.org/MarkUp/2004/02/xhtml-rdf" target="_top">http://www.w3.org/MarkUp/2004/02/xhtml-rdf</a>
                  					
               </p>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="introduction.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="introduction.html">Niveau sup&eacute;rieur</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="objet.html">Suivant</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">Introduction&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td>
               <td width="40%" align="right" valign="top">&nbsp;Objet de la recommandation</td>
            </tr>
         </table>
      </div>
   </body>
</html>