<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Les m&eacute;tadonn&eacute;es descriptives</title>
      <link rel="stylesheet" href="Traduc.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.67.2">
      <link rel="start" href="index.html" title="Les m&eacute;tadonn&eacute;es des th&egrave;ses &eacute;lectroniques fran&ccedil;aises">
      <link rel="up" href="raison_d_etre.html" title="Raison d'&ecirc;tre de la recommandation">
      <link rel="prev" href="raison_d_etre.html" title="Raison d'&ecirc;tre de la recommandation">
      <link rel="next" href="intro_md_gestion.html" title="Les m&eacute;tadonn&eacute;es de gestion">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <h2 class="subtitle">TEF 2.0</h2>
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">Les m&eacute;tadonn&eacute;es descriptives</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="raison_d_etre.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <th width="60%" align="center">Raison d'&ecirc;tre de la recommandation</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="intro_md_gestion.html">Suivant</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="fr">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="intro_md_desc"></a>Les m&eacute;tadonn&eacute;es descriptives
                  </h2>
               </div>
            </div>
         </div>
         <p>Les m&eacute;tadonn&eacute;es descriptives ont une fonction bibliographique.
                    Elles doivent permettre de trouver, d&#8217;identifier, de s&eacute;lectionner le
                    document et enfin d&#8217;y acc&eacute;der.<sup>[<a name="d0e161" href="#ftn.d0e161">5</a>]</sup> Elles r&eacute;pondent aux objectifs bibliographiques
                    traditionnels tout en les adaptant &agrave; l&#8217;environnement num&eacute;rique et au
                    Web en particulier.
         </p>
         <p>En prenant la forme d&#8217;un document num&eacute;rique en ligne, la th&egrave;se
            devient une ressource Web parmi d&#8217;autres (m&ecirc;me si elle ob&eacute;it &agrave; des
            contraintes de validation administrative et scientifique
            particuli&egrave;res). Le signalement des th&egrave;ses ne passe plus seulement par
            les catalogues de biblioth&egrave;que, qu&#8217;ils soient locaux ou collectifs,
            mais par une vari&eacute;t&eacute; de bases ou de r&eacute;pertoires. Pour ne pas rester
            confin&eacute;es dans les catalogues de biblioth&egrave;que ou les outils
                    bibliographiques sp&eacute;cialis&eacute;s, les th&egrave;ses doivent pouvoir &ecirc;tre
                    signal&eacute;es ou r&eacute;f&eacute;renc&eacute;es en m&ecirc;me temps et de la m&ecirc;me fa&ccedil;on que
                    d&#8217;autres ressources (dans des entrep&ocirc;ts institutionnels ou non,
                    th&eacute;matiques ou non, internationaux ou non, par des moteurs de
                    recherche g&eacute;n&eacute;ralistes...). Pour ce faire, les th&egrave;ses doivent &ecirc;tre
                    d&eacute;crites selon des ensembles de m&eacute;tadonn&eacute;es et des formats largement
                    partag&eacute;s sur le Web.
         </p>
         <p>Il s&#8217;agit de trouver un compromis entre un signalement minimal
                    mais largement partag&eacute; sur le Web (notamment via le protocole
                    OAI-PMH<a href="glossaire.html#GlossOAI">**</a> qui exige <span class="emphasis"><em>a
                          minima</em></span> une description en Dublin Core simple<a href="glossaire.html#GlossDCsimple">**</a>) et le signalement plus riche qui
                    convient &agrave; la bibliographie nationale des th&egrave;ses fran&ccedil;aises, int&eacute;gr&eacute;e
                    dans le catalogue Sudoc. En d&#8217;autres termes, au-del&agrave; des formats (XML
                    ou ISO 2709), il s&#8217;agit de trouver un compromis entre d'une part le
                    vocabulaire Dublin Core et d'autre part les normes bibliographiques
                    internationales et nationales, les r&egrave;gles de description des th&egrave;ses du
                    r&eacute;seau SUDOC qui pr&eacute;cisent ces normes et enfin le format UNIMARC qui
                    les encode.
         </p>
         <p>La description bibliographique des th&egrave;ses dans TEF repose sur un
                    noyau de m&eacute;tadonn&eacute;es issues du Dublin Core. A chaque fois que cela a
                    &eacute;t&eacute; n&eacute;cessaire, ce noyau a &eacute;t&eacute; enrichi par des &eacute;l&eacute;ments nouveaux,
                    appartenant &agrave; l'espace de noms TEF.
         </p>
         <p>S'inscrire dans le contexte global du Web ne signifie pas
                    renoncer aux acquis de l'expertise bibliographique. Au contraire, dans
                    la perspective du Web s&eacute;mantique, la notion de contr&ocirc;le d'autorit&eacute;
                    trouve une l&eacute;gitimit&eacute; renforc&eacute;e et de nouvelles potentialit&eacute;s. Il faut
                    en effet tirer les cons&eacute;quences d'un changement important : le
                    contr&ocirc;le d'autorit&eacute; ne s'exerce plus &agrave; l'&eacute;chelle locale, voire
                    nationale, d'un catalogue de biblioth&egrave;que, mais peut s'exercer &agrave;
                    l'&eacute;chelle globale du Web, notamment gr&acirc;ce &agrave; l'utilisation des <a href="glossaire.html#GlossURI">URI</a> comme identifiants uniques. C'est dans
                    cet esprit que la recommandation pr&eacute;voit d'attacher des autorit&eacute;s &agrave; de
                    nombreux &eacute;l&eacute;ments TEF.
         </p>
         <p>TEF propose deux m&eacute;thodes pour g&eacute;r&eacute;r les donn&eacute;es d'autorit&eacute;.
                    Selon une premi&egrave;re m&eacute;thode, on associe &agrave; un &eacute;l&eacute;ment TEF l'identifiant
                    de l'autorit&eacute; et le nom du r&eacute;f&eacute;rentiel d'autorit&eacute; auquel elle
                    appartient (SUDOC, BnF). On parle alors d'autorit&eacute; externe
                    autoriteExterne). Selon une autre m&eacute;thode, la notice TEF elle-m&ecirc;me
                    englobe les donn&eacute;es d'autorit&eacute; associ&eacute;es &agrave; une personne (morale ou
                    physique). Le lien entre l'&eacute;l&eacute;ment TEF et ses autorit&eacute;s est interne &agrave;
                    la notice TEF. Il est possible d'utiliser les deux m&eacute;thodes
                    conjointement. La premi&egrave;re m&eacute;thode est pr&eacute;f&eacute;rable.
                    (<span class="emphasis"><em>cf.</em></span> <a href="adminMeta.html#autorites" title="Les donn&eacute;es d'autorit&eacute;s dans TEF">plus
                       loin</a>)
         </p>
         <div class="footnotes"><br><hr width="100" align="left">
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e161" href="#d0e161">5</a>] </sup><a href="http://www.ifla.org/VII/s13/frbr/frbr.pdf" target="_top">http://www.ifla.org/VII/s13/frbr/frbr.pdf</a>
                              (section 6.1)
               </p>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="raison_d_etre.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="raison_d_etre.html">Niveau sup&eacute;rieur</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="intro_md_gestion.html">Suivant</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">Raison d'&ecirc;tre de la recommandation&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td>
               <td width="40%" align="right" valign="top">&nbsp;Les m&eacute;tadonn&eacute;es de gestion</td>
            </tr>
         </table>
      </div>
   </body>
</html>