<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Quelles sont les m&eacute;tadonn&eacute;es pertinentes pour TEF ?</title>
      <link rel="stylesheet" href="Traduc.css" type="text/css">
      <meta name="generator" content="DocBook XSL Stylesheets V1.67.2">
      <link rel="start" href="index.html" title="Les m&eacute;tadonn&eacute;es des th&egrave;ses &eacute;lectroniques fran&ccedil;aises">
      <link rel="up" href="raison_d_etre.html" title="Raison d'&ecirc;tre de la recommandation">
      <link rel="prev" href="intro_md_gestion.html" title="Les m&eacute;tadonn&eacute;es de gestion">
      <link rel="next" href="modeleTEF.html" title="Mod&eacute;lisation des m&eacute;tadonn&eacute;es de th&egrave;se">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <h2 class="subtitle">TEF 2.0</h2>
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">Quelles sont les m&eacute;tadonn&eacute;es pertinentes pour TEF ?</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="intro_md_gestion.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <th width="60%" align="center">Raison d'&ecirc;tre de la recommandation</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="modeleTEF.html">Suivant</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="sect1" lang="fr">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a name="intro_md_pertinentes"></a>Quelles sont les m&eacute;tadonn&eacute;es pertinentes pour TEF ?
                  </h2>
               </div>
            </div>
         </div>
         <p>Le dispositif national de promotion des th&egrave;ses &eacute;lectroniques
                    distingue le niveau local du niveau national.<sup>[<a name="d0e224" href="#ftn.d0e224">6</a>]</sup> Au niveau local, les &eacute;tablissements sont principalement
            responsables de l'encadrement du travail de recherche et de r&eacute;daction
            de la th&egrave;se, de la pr&eacute;paration de la soutenance, de la validation de
            la version officielle de la th&egrave;se et enfin de la d&eacute;livrance du
                    dipl&ocirc;me. Naturellement, &agrave; c&ocirc;t&eacute; de ces missions qui sont de leur
                    responsabilit&eacute; exclusive, les &eacute;tablissements de soutenance peuvent
                    veiller aussi &agrave; la diffusion de la th&egrave;se, &agrave; son signalement ou encore
                    &agrave; sa conservation. Toutefois, ces derni&egrave;res op&eacute;rations ne rel&egrave;vent
                    <span class="emphasis"><em>pas</em></span> <span class="emphasis"><em>exclusivement</em></span> du niveau
                    local. Elles peuvent &ecirc;tre prises en charge par d'autres acteurs, &agrave;
                    vocation nationale ou non. En particulier, le signalement exhaustif
                    des th&egrave;ses fran&ccedil;aises est une des missions confi&eacute;es au catalogue
                    collectif SUDOC, qui fait office de bibliographie nationale des
                    th&egrave;ses. De m&ecirc;me, le CINES a une mission nationale d'archivage p&eacute;renne
                    des th&egrave;ses &eacute;lectroniques. D'une mani&egrave;re g&eacute;n&eacute;rale, diffusion,
                    signalement et archivage des th&egrave;ses sont des op&eacute;rations qui peuvent
                    &ecirc;tre prises en charge par une pluralit&eacute; d'acteurs.
         </p>
         <p>C'est pr&eacute;cis&eacute;ment cette diversit&eacute; des acteurs qui donne &agrave; TEF sa
                    raison d'&ecirc;tre et qui en fixe le p&eacute;rim&egrave;tre. Pour mener &agrave; bien leurs
                    missions, tous ces acteurs ont besoin de disposer de m&eacute;tadonn&eacute;es
                    structur&eacute;es. Beaucoup d'entre elles ne peuvent &ecirc;tre connues que par
                    l'&eacute;tablissement de soutenance. C'est le cas notamment des m&eacute;tadonn&eacute;es
                    de droits qui, &agrave; ce titre, ont leur place dans TEF. En revanche,
                    l'&eacute;tablissement de soutenance poss&egrave;de des informations sur les th&egrave;ses
                    qui ne sont pas utiles &agrave; l'exercice des missions de diffusion, de
                    signalement et d'archivage. C'est le cas notamment de toutes les
                    informations administratives qui concernent le d&eacute;roulement de la
                    recherche ou la pr&eacute;paration de la soutenance. Ces m&eacute;tadonn&eacute;es ont un
                    int&eacute;r&ecirc;t strictement local. Elles n'int&eacute;ressent pas les tiers ; elles
                    n'int&eacute;ressent donc pas TEF. Par ailleurs, quand certaines m&eacute;tadonn&eacute;es
                    pertinentes peuvent ais&eacute;ment &ecirc;tre g&eacute;n&eacute;r&eacute;es par l'un de ces tiers, il
                    n'est pas n&eacute;cessaire de demander &agrave; l'&eacute;tablissement de soutenance de
                    les fournir. C'est le cas, par exemple, de certaines m&eacute;tadonn&eacute;es
                    utiles &agrave; la conservation qui sont plus faciles &agrave; g&eacute;n&eacute;rer pour le
                    responsable de la conservation que pour l'&eacute;tablissement de soutenance
                    - sauf dans le cas o&ugrave; ce dernier conduit une action d'archivage
                    p&eacute;renne dans le cadre d'une politique de site. Ces m&eacute;tadonn&eacute;es tr&egrave;s
                    sp&eacute;cialis&eacute;es n'int&eacute;ressent pas non plus TEF.
         </p>
         <p>C'est pourquoi <span class="bold"><strong>TEF ne comprend que les
                          m&eacute;tadonn&eacute;es qui sont &agrave; la fois connues par l'&eacute;tablissement de
                          soutenance et indispensables aux autres acteurs en charge d'une
                          mission de diffusion, de signalement ou de
                          conservation</strong></span>.
         </p>
         <p>En compl&eacute;ment, TEF comprend des m&eacute;tadonn&eacute;es administratives
                    <span class="emphasis"><em>facultatives</em></span> qui permettent de <span class="bold"><strong>dresser un panorama global de la production doctorale en
                          France</strong></span>, de situer les th&egrave;ses dans leur environnement
                    scientifique et de mener des &eacute;tudes infom&eacute;triques. Ces m&eacute;tadonn&eacute;es TEF
                    ne sont pas obligatoires, mais elles sont recommand&eacute;es. Ces
                    informations sont d&eacute;j&agrave; connues des &eacute;tablissements de soutenance
                    puisqu'elles sont requises dans le processus de pr&eacute;paration de la
                    soutenance. Il s'agit prioritairement de l'identit&eacute; des rapporteurs,
                    de la composition du jury et des organismes partenaires qui ont
                    accompagn&eacute; ou assist&eacute; les travaux du doctorant (laboratoire,
                    universit&eacute;, entreprise...). Il est recommand&eacute; de les int&eacute;grer aux
                    notices TEF pour permettre &agrave; ces donn&eacute;es administratives d'&ecirc;tre
                    exploit&eacute;es pour d'autres usages, notamment infom&eacute;triques.
         </p>
         <div class="footnotes"><br><hr width="100" align="left">
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e224" href="#d0e224">6</a>] </sup>
                                <a href="http://www.sup.adc.education.fr/bib/Acti/These/circulaire.rtf" target="_top">http://www.sup.adc.education.fr/bib/Acti/These/circulaire.rtf</a>
                              
               </p>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="intro_md_gestion.html">Pr&eacute;c&eacute;dent</a>&nbsp;
               </td>
               <td width="20%" align="center"><a accesskey="u" href="raison_d_etre.html">Niveau sup&eacute;rieur</a></td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="modeleTEF.html">Suivant</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">Les m&eacute;tadonn&eacute;es de gestion&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td>
               <td width="40%" align="right" valign="top">&nbsp;Mod&eacute;lisation des m&eacute;tadonn&eacute;es de th&egrave;se</td>
            </tr>
         </table>
      </div>
   </body>
</html>